stress/stress-get.yml
config:
  target: 'http://127.0.0.1:3000'
  processor: './stress.js'
  phases:
    - duration: 30
      arrivalRate: 20
scenarios:
  - name: 'GET test from last million entries'
    flow:
    - loop:
      - function: 'randomId'
      - get:
          url: '/api/restaurant/{{ id }}'
      count: 20